{
  "governmentContracting": {
    "stepTwoStepperLabel": "Apprenticeship Program",
    "stepOneButtonLink": "https://www.njstart.gov/bso/",
    "stepThreeContent": "## Register Your Business as a Public Works Contractor\n\nIf you are interested in working on `public works|public-works` contracts, you must register with the Division of Wage and Hour Compliance within the NJ Department of Labor and Workforce Development (NJ DOL). The Public Works Contractor Registration Act (PW CRA) requires registration.\n\nYou can apply online or by mail. However, the agency strongly recommends online applications. Effective August 15, 2024, applications will only be accepted online. If\nIf you cannot complete the online application, email pwcr@dol.nj.gov to notify the Public Works Contractor Registration (PW CR) section.\n\n### Registration Requirements\n\n*  `EIN|ein` \n*  `NAICS code|naics` \n*  `Business structure|business-structure-learn-more` \n*  `Workers’ compensation insurance|workers-comp` \n* Responsible owners’ information, such as Social Security number (SSN)\n* Disclosure of responsible owner’s `interest|interest` in another firm that has applied for or obtained a `prevailing wage|prevailing-wage` CR certificate or has bid on or performed work on a project requiring payment of the prevailing wage\n* List of any other business interest\n* Registered apprenticeship certification statement\n* List any notice of violations received from NJDOL, USDOL, or any other state or federal labor law within the last 5 years\n* List of all `prevailing wage|prevailing-wage` `craft's|craft` \n* Applicable fees paid\n*  `Registered agent|registered-agent` , if applicable\n* Permit to maintain payroll records outside of New Jersey, if applicable\n\n:::callout{ showHeader=\"true\" headerText=\"What happens if I’m not registered?\" showIcon=\"false\" calloutType=\"warning\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nIf you are bidding on or working on a public works contract without registration, you can be fined up to $2,500.\n\n:::\n\n:::callout{ showHeader=\"true\" headerText=\"\" showIcon=\"false\" calloutType=\"conditional\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nA PW CR certificate indicating compliance with PW CRA.\n\n:::",
    "stepFourContent": "\n## Ensure Your Staff Has Prevailing Wage\n\nIf you want to work on New Jersey public works contracts, you must register with the Division of Wage and Hour Compliance within the New Jersey Department of Labor (NJDOL) per the Public Works Contractor Registration Act.\n\nPer the [NJ State Prevailing Wage Act](https://www.nj.gov/labor/wageandhour/tools-resources/laws/prevailingwageact.shtml), the NJ DOL determines the `prevailing wage|prevailing-wage` on `public works|public-works` projects.\n\nYou must submit certified payroll records for each employee within 10 days of the payment of wages. You can either submit the [MW-562](<https://www.nj.gov/labor/wageandhour/assets/PDFs/wagehub/MW-562%20(6-23)%20PayrollCert-PublicWorks.pdf>) form, or submit online via the [NJ Wage](https://njwages.nj.gov/) Hub. Effective August 15, 2024, certified payroll records will only be accepted online.\n\nAlso, you must maintain the following records for a 2-year period from the date of payment:\n\n- Employee information, such as Social Security number (SSN) and job trade\n- Rates of pay\n\n  - Hourly\n  - Daily\n  - Weekly\n  - Overtime\n\n- Itemized deductions\n- Net pay\n",
    "stepTwoButtonLink": "https://nj.gov/labor/lwdhome/apprenticeship/apprenticeshipOnboarding.html",
    "stepFourButtonText": "",
    "stepThreeButtonText": "Complete My PW CR Application",
    "stepFourStepperLabel": "Prevailing Wages",
    "stepThreeStepperLabel": "Public Works",
    "stepTwoContent": "\n## Submit Your Apprenticeship Program Intake Form\n\nHaving an apprenticeship program is a requirement to be a contractor. This program allows you to develop skilled employees who work to meet your business needs. You can develop the training to best suit your business.\n\nStart the process by connecting with the New Jersey Department of Labor (NJDOL) Office of Apprenticeship. They will walk you through the registration process and your responsibilities as a program sponsor.\n\nYou will then work with a representative from the United States Department of Labor (USDOL) to develop and register your program.\n\n---\n\n### Intake Form Requirements\n\n- Business name\n- `Business Structure|business-structure-learn-more`\n- Primary contact information\n- List of occupations to be developed in the program\n\n:::callout{ showHeader=\"true\" headerText=\"\" showIcon=\"false\" calloutType=\"conditional\" }\n\nAn email invite to schedule a virtual meeting for a needs assessment with the Office of Apprenticeship.\n\n:::\n",
    "stepOneButtonText": "Register My Business with NJSTART",
    "backButtonLabel": "Back",
    "continueButtonLabel": "Continue",
    "stepOneStepperLabel": "NJSTART",
    "stepFourButtonLink": "",
    "stepThreeButtonLink": "https://www.njportal.com/lwd/pwcr",
    "stepOneContent": "## Register Your Business with NJSTART\n\nBusinesses interested in working with the State must register with NJ State of the Art Requisition Technology (NJSTART). Registering provides you with the latest information about contracting opportunities and helps you track the status of your contracts.\n\nThe Division of Purchase and Property (DPP), within the Department of the Treasury, serves as the State's central procurement agency for goods and services contracts. These goods and services can include office supplies, electronic equipment, vehicles, etc.\n\nRegister with NJSTART to find bidding opportunities for goods and services through the DPP.\n\n### Registration Requirements\n\n1. Complete your pre-registration by submitting the following information:\n\n*  `EIN|ein` or Social Security number (SSN)\n* Business Name\n* Email address - You will then receive an email with your Vendor ID number and login link.\n\n2. Complete your registration by providing the following information:\n\n*  `Tax ID|tax-id` \n* Business Name\n* Profile administrator’s information (name, title, address, etc.). The administrator maintains and updates the business profile (also known as “vendor profile”)\n* Primary business function\n* Business formation\n* Electronic funds transfer certification\n* Tax ID certification statement\n*  `NIGP commodity code|nigp-commodity-code` \n\n:::callout{ showHeader=\"true\" headerText=\"\" showIcon=\"false\" calloutType=\"conditional\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nA confirmation email.\n\n:::\n\n:::callout{ showHeader=\"false\" headerText=\"\" showIcon=\"false\" calloutType=\"informational\" }\n\nOn the [Vendor](https://www.nj.gov/treasury/purchase/vendor.shtml) page, click on the Vendors Quick Reference Guides tab. Next, click on the Registration Guide for more information about registering.\n\n:::",
    "stepTwoButtonText": "Submit Your Apprenticeship Program Intake Form"
  }
}