{
  "governmentContracting": {
    "stepTwoStepperLabel": "Apprenticeship Program",
    "stepOneButtonLink": "https://www.njstart.gov/bso/",
    "stepThreeContent": "## Register Your Business as a Public Works Contractor\n\nIf you are interested in working on `public works|public-works` contracts, you must register with the Division of Wage and Hour Compliance within the NJ Department of Labor and Workforce Development (NJ DOL). The Public Works Contractor Registration Act (PW CRA) requires registration.\n\nYou can apply online or by mail. However, the agency strongly recommends online applications. Effective August 15, 2024, applications will only be accepted online. If\nIf you cannot complete the online application, email pwcr@dol.nj.gov to notify the Public Works Contractor Registration (PW CR) section.\n\n### Registration Requirements\n\n*  `EIN|ein` \n*  `NAICS code|naics` \n*  `Business structure|business-structure-learn-more` \n*  `Workers’ compensation insurance|workers-comp` \n* Responsible owners’ information, such as Social Security number (SSN)\n* Disclosure of responsible owner’s `interest|interest` in another firm that has applied for or obtained a `prevailing wage|prevailing-wage` CR certificate or has bid on or performed work on a project requiring payment of the prevailing wage\n* List of any other business interest\n* Registered apprenticeship certification statement\n* List any notice of violations received from NJDOL, USDOL, or any other state or federal labor law within the last 5 years\n* List of all `prevailing wage|prevailing-wage` `craft's|craft` \n* Applicable fees paid\n*  `Registered agent|registered-agent` , if applicable\n* Permit to maintain payroll records outside of New Jersey, if applicable\n\n:::callout{ showHeader=\"true\" headerText=\"What happens if I’m not registered?\" showIcon=\"false\" calloutType=\"warning\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nIf you are bidding on or working on a public works contract without registration, you can be fined up to $2,500.\n\n:::\n\n:::callout{ showHeader=\"true\" headerText=\"\" showIcon=\"false\" calloutType=\"conditional\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nA PW CR certificate indicating compliance with PW CRA.\n\n:::",
    "stepFourContent": "## Ensure Your Staff Has Prevailing Wage\n\nIf you want to work on New Jersey public works contracts, you must register with the Division of Wage and Hour Compliance within the New Jersey Department of Labor (NJDOL) per the Public Works Contractor Registration Act.\n\nPer the [NJ State Prevailing Wage Act](https://www.nj.gov/labor/wageandhour/tools-resources/laws/prevailingwageact.shtml), the NJ DOL determines the `prevailing wage|prevailing-wage` on `public works|public-works` projects.\n\nYou must submit certified payroll records for each employee within 10 days of the payment of wages. You can either submit the [MW-562](https://www.nj.gov/labor/wageandhour/assets/PDFs/wagehub/MW-562%20(6-23)%20PayrollCert-PublicWorks.pdf) form, or submit online via the [NJ Wage](https://njwages.nj.gov/) Hub. Effective August 15, 2024, certified payroll records will only be accepted online.\n\nAlso, you must maintain the following records for a 2-year period from the date of payment:\n\n* Employee information, such as Social Security number (SSN) and job trade\n* Rates of pay\n\n  * Hourly\n  * Daily\n  * Weekly\n  * Overtime\n* Itemized deductions\n* Net pay",
    "stepTwoButtonLink": "https://nj.gov/labor/lwdhome/apprenticeship/apprenticeshipOnboarding.html",
    "stepFourButtonText": "",
    "stepThreeButtonText": "Complete My PW CR Application",
    "stepFourStepperLabel": "Prevailing Wages",
    "stepThreeStepperLabel": "Public Works",
    "stepTwoContent": "## Submit Your Apprenticeship Program Intake Form\n\nHaving an apprenticeship program is a requirement to be a contractor. This program allows you to develop skilled employees who work to meet your business needs. You can develop the training to best suit your business.\n\nStart the process by connecting with the New Jersey Department of Labor (NJDOL) Office of Apprenticeship. They will walk you through the registration process and your responsibilities as a program sponsor.\n\nYou will then work with a representative from the United States Department of Labor (USDOL) to develop and register your program.\n\n- - -\n\n### Intake Form Requirements\n\n* Business name\n*  `Business Structure|business-structure-learn-more` \n* Primary contact information\n* List of occupations to be developed in the program\n\n:::callout{ showHeader=\"true\" headerText=\"\" showIcon=\"false\" calloutType=\"conditional\" amountIconText=\"\" filingTypeIconText=\"\" frequencyIconText=\"\" phoneIconText=\"\" emailIconText=\"\" }\n\nAn email invite to schedule a virtual meeting for a needs assessment with the Office of Apprenticeship.\n\n:::",
    "stepOneButtonText": "Register My Business with NJSTART",
    "backButtonLabel": "Back",
    "continueButtonLabel": "Continue",
    "stepOneStepperLabel": "NJSTART",
    "stepFourButtonLink": "",
    "stepThreeButtonLink": "https://www.njportal.com/lwd/pwcr",
    "stepOneContent": "## Register Your Business with NJSTART\n\nIf you want to work on public works\n\nIf you want to work on `public works|public-works` contracts with the State of New Jersey, you must register with\n\n `NJSTART.|njstart` NJSTART is the State’s official online system for vendor registration and payments.\n\nAll businesses must be registered in NJSTART before they can bid on or be awarded State contracts. Once registered, you’ll be able to check the status of your contracts, get updates on new opportunities, and receive payments. \n\n## Pre-Registration Requirements\n\n* EIN \\[insert CI] or Social Security number (SSN)\n* Business name\n* Email address (you will be emailed your Supplier ID and login information)\n\n## Registration Requirements\n\nTo set up your NJSTART profile, you must provide the following:\n\n* Supplier ID\n* Tax ID \\[insert CI]\n* Administrative user information, including address (the person who updates and maintains your NJSTART profile)\n* Primary business function (the goods or services your business provides)\n* Business structure \\[insert CI]\n* Electronic funds transfer certification (how you want to receive payments from the State)\n* Tax ID certification (confirms your Tax ID is correct and you're either a U.S. citizen or taxpayer, like a green card holder or permanent resident)\n* NIGP \\[insert CI] commodity code(s)\n\n### Additional Requirements\n\nBefore you submit your first bid, you must provide the following:\n\n* Names, titles, and addresses of all officers or directors, if a nonprofit\n* Name and address of anyone owning more than 10% interest in the business, if applicable \n* Documentation of any criminal history in the past 5 years, if applicable\n\nFor more information about registering with NJSTART, view the Vendor Quick Reference Guide.",
    "stepTwoButtonText": "Submit Your Apprenticeship Program Intake Form"
  }
}